{
  "about": "Über mich",
  "articles": "Artikel",
  "projects": "Projekte",
  "contact me": "Kontaktiere mich",
  "sign-in": "Einloggen",
  "sign-out": "Ausloggen",
  "title1": "Mein",
  "title2": "Full Stack",
  "title3": "Reise: Projekte und Fähigkeiten",
  "paragraphe-top": "Willkommen auf meiner Full-Stack-Reise! Ich bin leidenschaftlich daran interessiert, dynamische und interaktive Webanwendungen zu erstellen, und ich habe meine Fähigkeiten in JavaScript, React.js und Node.js geschärft, um innovative Ideen zum Leben zu erwecken. Mit einem tiefen Verständnis für Front-End- und Back-End-Entwicklung",
  "allprojects": "Alle Projekte",
  "paragraphecontact": "Kontaktieren Sie mich für weitere Informationen",
  "email": "Email",
  "message": "Ihre Nachricht",
  "submit": "Senden",
  "rightreserved": "Alle Rechte vorbehalten",
  "abouttitle": "Professionelle Konfluenz: Vom Führen in Statistik und Verwaltung bis zum Meistern der Webentwicklung.",
  "aboutparagraphe1": "Im Laufe meiner beruflichen Karriere habe ich verschiedene Positionen innegehabt, die meine Fähigkeiten erweitert und mein interdisziplinäres Verständnis geprägt haben. Als Leiter für statistische Arbeiten habe ich Expertise in der Datenanalyse entwickelt und entscheidende Erkenntnisse für die Entscheidungsfindung bereitgestellt. Diese Erfahrung wurde durch meine Rolle als Leiter für Verwaltung und Ressourcen ergänzt, wo ich ein tiefes Verständnis für operatives Management und Ressourcenoptimierung gewonnen habe.",
  "aboutparagraphe2": "Als Filialleiter habe ich erweiterte Verantwortlichkeiten übernommen, Teams beaufsichtigt und Großprojekte koordiniert. Diese Erfahrung hat meine Fähigkeit zur effektiven Führung und Verwaltung gestärkt, um sicherzustellen, dass die organisatorischen Ziele erfolgreich erreicht wurden.",
  "aboutparagraphe3": "Parallel zu meiner Reise im administrativen Bereich habe ich auch meine Leidenschaft für die Webentwicklung angenommen. Als kontinuierlich weiterentwickelter Profi habe ich umfassende Kenntnisse als Full-Stack-Entwickler erworben und Technologien wie React und Node.js eingesetzt, um innovative und benutzerfreundliche Webanwendungen zu erstellen.",
  "aboutparagraphe4": "Diese einzigartige Kombination von Erfahrungen hat mir eine ganzheitliche Perspektive und vielseitige Fähigkeiten verliehen. Heute treibt mich der Wunsch an, meine vielfältigen Fähigkeiten zu vereinen, um innovative technologische und administrative Lösungen für zeitgenössische Herausforderungen zu schaffen. Meine vielseitige Reise spiegelt meine Entschlossenheit wider, mich ständig weiterzuentwickeln und einen bedeutungsvollen Beitrag zu leisten, sei es im Bereich der Statistik, der Verwaltungsleitung oder der Webentwicklung.",
  "login": "Einloggen",
  "password": "Passwort",
  "subtitlesignin": "Ich habe kein Konto?",
  "signup": "registrieren",
  "confirmpassword": "Passwort bestätigen",
  "titlebuttonsignup": "Habe bereits ein Konto",
  "process": "MERN Web Prozess",
  "processparagraph": "Der MERN-Lernpfad beginnt mit der Beherrschung von HTML und CSS zur Erstellung von Webstrukturen und -stilen. Anschließend vertiefen sich die Lernenden in JavaScript, beginnend mit der Vanilla-Version, um die Grundlagen der Sprache und die Manipulation des DOM zu verstehen. Eine natürliche Übergang führt zu React.js, wo die Modularität der Komponenten die Erstellung dynamischer Benutzeroberflächen vereinfacht. Auf der Serverseite ermöglicht die Erkundung von Node.js und Express.js die Entwicklung von robusten und effizienten Servern. Die Integration von MongoDB vervollständigt die Reise, indem sie die erforderlichen Fähigkeiten zur flexiblen Datenverwaltung bereitstellt. Dieser sequenzielle Prozess vermittelt ein umfassendes Verständnis der MERN-Entwicklung, von der Front-End-Gestaltung bis zur serverseitigen Datenverwaltung, und bildet so eine solide Grundlage für die Erstellung moderner Webanwendungen.",
  "home": "Startseite",
  "connecting": "Einloggen mit",
  "emailverified": "E-Mail erfolgreich verifiziert",
  "404":"Seite nicht gefunden!",
  "tknvalid":"Ungültiges Token",
  "emalreverified":"Email bereits verifiziert",
  "toknotfound":"Token nicht gefunden",
  "errorlors":"Fehler bei der Bestätigung der E-Mail.",
  "emailexist":"Email existiert bereits",
  "emaintnon":"Email oder Passwort falsch",
  "upload":"Herunterladen",
  "thanksevaliation":"Vielen Dank für Ihre",
  "star":"Stern(e)",
  "checkemail":"Bitte überprüfen Sie Ihre E-Mail",
  "Sign-inSuccessfully":"Anmeldung erfolgreich",
    "Sign-outSuccessfully":"Abmeldung erfolgreich",
    "thankformessage":"Vielen Dank für Ihre Nachricht !",
    "désquepossible":"Wir werden uns so schnell wie möglich bei Ihnen melden",
    "emailnotvalid":"Ungültige E-Mail-Adresse",
    "messagenotvalid":"Mindestens:10 Zeichen, Maximal:250 Zeichen",
    "emailnotconfirm":"Bitte bestätigen Sie Ihre E-Mail-Adresse",
    "more":"Mehr",
    "titlecoulisse":"Ein Einblick hinter die",
    "coulisses":"Kulissen",
    "title2coulisse":"meines Portfolios",
    "paragrapheaccordion":"Für mich ist technische Transparenz entscheidend, daher möchte ich die Hintergründe des Erstellungsprozesses meiner Website teilen. Durch die Enthüllung der Kulissen der Infrastruktur soll ein klares Verständnis für die Plattform vermittelt werden. Auf der Frontend-Seite habe ich Tools bevorzugt, die eine dynamische und reaktive Benutzererfahrung gewährleisten. Der Schwerpunkt lag auf schneller Entwicklung mit geeigneten Optimierungslösungen. Für das Hosting wurde eine zuverlässige Plattform ausgewählt, und auf der Backend-Seite wurden Technologien ausgewählt, um eine solide Grundlage zu gewährleisten. Sicherheit war eine Hauptanliegen, mit der Umsetzung von Protokollen, um den Schutz der Benutzer zu gewährleisten. Die Absicht hinter dieser technischen Transparenz ist, vollstes Vertrauen aufzubauen und das Bekenntnis zu einem modernen, leistungsstarken und sicheren Ansatz in der Webentwicklung zu betonen."
    


}
