{
    
    "about":"about",
    "articles":"articles",
    "projects":"projects",
    "contact me":"contact me",
    "sign-in":"sign in",
    "sign-out":"Sign-out",
    "title1":"My", 
    "title2":"Full Stack",
    "title3":"Journey : Projects and Skills",
    "paragraphe-top":"Welcome to my Full Stack journey! I'm passionate about creating dynamic and interactive web applications, and I've honed my skills in JavaScript, React.js, and Node.js to bring innovative ideas to life. With a deep understanding of front-end and back-end development",
    "allprojects":"All Projects",
    "paragraphecontact":"Contact me for more information",
    "email":"Email",
    "message":"Your Message",
    "submit":"Submit",
    "rightreserved":"All rights Reserved",
    "abouttitle":"Professional Confluence: From Leadership in Statistics and Administration to Mastering Web Development.",
    "aboutparagraphe1":"Throughout my professional career, I have held various positions that have enriched my skill set and shaped my multidisciplinary understanding. As a statistical works supervisor, I developed expertise in data analysis, providing crucial insights for decision-making. This experience was complemented by my role as head of administration and resources, where I gained a deep understanding of operational management and resource optimization.",
    "aboutparagraphe2":"As a branch manager, I undertook expanded responsibilities, overseeing teams and coordinating large-scale projects. This experience enhanced my ability to lead and manage effectively, ensuring that organizational objectives were successfully achieved.",
    "aboutparagraphe3":"Alongside my journey in the administrative field, I have also embraced my passion for web development. As a continuously evolving professional, I have gained strong expertise as a full-stack developer, utilizing technologies such as React and Node.js to create innovative and user-friendly web applications.",
    "aboutparagraphe4":"This unique combination of experiences has endowed me with a holistic perspective and versatile skills. Today, I am driven by the desire to merge my diverse skills to create innovative technological and administrative solutions that address contemporary challenges. My varied journey reflects my determination to evolve constantly and make a meaningful contribution, whether in the realm of statistics, administrative management, or web development.",
    "login":"Sign in",
    "password":"Password",
    "subtitlesignin":"Dont have an account?",
    "signup":"Sign up",
    "confirmpassword":"Confirm Password",
    "titlebuttonsignup":"Already have an Acount",
    "process":" MERN Web Process",
    "processparagraph":"The MERN learning path begins with mastering HTML and CSS for creating web structures and styles. Subsequently, learners delve into JavaScript, starting with the vanilla version, to understand the language's fundamentals and DOM manipulation. A natural transition leads to React.js, where the modularity of components simplifies the creation of dynamic user interfaces. On the server side, exploring Node.js and Express.js enables the development of robust and efficient servers. The integration of MongoDB completes the journey by providing the necessary skills to manage data flexibly. This sequential process provides a comprehensive understanding of MERN development, from front-end design to server-side data management, thereby forming a solid foundation for building modern web applications.",
    "home":"Home",
    "connecting":"Sign-in With",
    "emailverified":"Email verified successfully",
    "404":"page not found!",
    "tknvalid":"Token Not Valid",
    "emalreverified":"Email already verified",
    "toknotfound":"Token not found",
    "errorlors":"Error while confirming the email.",
    "emailexist":"Email already exists",
    "emaintnon":"Incorrect Email or Password",
    "upload":"Download",
    "thanksevaliation":"Thank you for your",
    "star":"star(s)",
    "checkemail":"Please Check Your Email",
    "Sign-inSuccessfully":"Sign-in Successfully",
    "Sign-outSuccessfully":"Sign-out Successfully",
    "thankformessage":"Thank you for your message !",
    "désquepossible":"We will get back to you as soon as possible",
    "emailnotvalid":"Email not Valid",
    "messagenotvalid":"Min:10 letters, Max:250 letters",
    "emailnotconfirm":"Please confirm your email",
    "more":"More",
    "titlecoulisse":"An Insight into the",
    "coulisses":"Behind the Scenes",
    "title2coulisse":"of my Portfolio",
    "paragrapheaccordion":"I consider technical transparency crucial, which is why I want to share the inner workings of the creation process of my website. By unveiling the behind-the-scenes of the infrastructure, the goal is to provide a clear understanding of the platform. On the frontend, I favored tools that ensure a dynamic and responsive user experience. Emphasis has been placed on rapid development with appropriate optimization solutions. For hosting, a reliable platform has been chosen, and on the backend, technologies have been selected to ensure a strong foundation. Security has been a major concern, with the implementation of protocols to ensure user protection. The intention behind this technical transparency is to build complete trust and underscore the commitment to a modern, high-performing, and secure approach to web development."
}