{
  "about": "A propos",
  "articles": "articles",
  "projects": "projets",
  "contact me": "Contactez-Moi",
  "sign-in": "se connecter",
  "sign-out": "déconnecter",
  "title1": "Mon Parcours ",
  "title2": "Full Stack",
  "title3": ": Projets et Compétences",
  "paragraphe-top": "Bienvenue dans mon parcours Full Stack ! Je suis passionné par la création d'applications Web dynamiques et interactives et j'ai perfectionné mes compétences en JavaScript, React.js et Node.js pour donner vie à des idées innovantes. Avec une compréhension approfondie du développement front-end et back-end",
  "allprojects": "Tous les Projets",
  "paragraphecontact": "Contactez-moi pour plus d'informations",
  "email": "Email",
  "message": "Votre Message",
  "submit": "Soumettre",
  "rightreserved": "Tous droits réservés",
  "abouttitle": "Confluence Professionnelle : Du Leadership en Statistiques et Administration à la Maîtrise du Développement Web.",
  "aboutparagraphe1": "Au cours de ma carrière professionnelle, j'ai occupé divers postes qui ont enrichi ma palette de compétences et ont façonné ma compréhension multidisciplinaire. En tant que chargé de travaux statistiques, j'ai développé une expertise dans l'analyse de données, fournissant des informations cruciales pour la prise de décision. Cette expérience a été complémentée par mon rôle en tant que chef de service administration et moyens, où j'ai acquis une compréhension approfondie de la gestion opérationnelle et de l'optimisation des ressources.",
  "aboutparagraphe2": "En tant que directeur d'agence, j'ai assumé des responsabilités élargies, supervisant des équipes et assurant la coordination de projets à grande échelle. Cette expérience a renforcé ma capacité à diriger et à gérer efficacement, en veillant à ce que les objectifs organisationnels soient atteints avec succès.",
  "aboutparagraphe3": "Parallèlement à mon parcours dans le domaine administratif, j'ai également embrassé ma passion pour le développement web. En tant que professionnel en pleine évolution, j'ai acquis une solide expertise en tant que développeur full-stack, utilisant des technologies telles que React et Node.js pour créer des applications web innovantes et conviviales.",
  "aboutparagraphe4": "Cette combinaison unique d'expériences m'a doté d'une perspective holistique et d'aptitudes polyvalentes. Aujourd'hui, je suis animé par le désir de fusionner mes compétences diverses pour créer des solutions technologiques et administratives novatrices qui répondent aux défis contemporains. Mon parcours varié reflète ma détermination à évoluer constamment et à apporter une contribution significative, que ce soit dans le monde des statistiques, de la gestion administrative, ou du développement web.",
  "login": "Ouverture de Session",
  "password": "Mot de Passe",
  "subtitlesignin": "Vous n'avez pas de compte ?",
  "signup": "s'inscrire",
  "confirmpassword": "Confirmez le mot de passe",
  "titlebuttonsignup": "Vous avez déjà un compte",
  "process": "Processus Web MERN",
  "processparagraph": "Le parcours d'apprentissage MERN débute par la maîtrise de\nHTML et CSS pour la création de structures et\nde styles web. Ensuite, les apprenants se plongent dans\nJavaScript, en commençant par la version vanilla, afin de\ncomprendre les fondements du langage et la manipulation du DOM. Une\ntransition naturelle conduit vers React.js, où la\nmodularité des composants simplifie la création d'interfaces utilisateur\ndynamiques. Du côté serveur, l'exploration de Node.js et\nExpress.js permet de développer des serveurs robustes et\nefficaces. L'intégration de MongoDB complète le parcours en\nfournissant les compétences nécessaires pour gérer les données de\nmanière flexible. Ce processus séquentiel offre une compréhension\nglobale du développement MERN, de la conception front-end à la gestion\ndes données côté serveur, formant ainsi une base solide pour la création\nd'applications web modernes.",
  "home": "Page d'accueil",
  "connecting": "Se connecter avec",
  "emailverified": "Email vérifié avec succès",
  "404":"page non trouvée!",
  "tknvalid":"jeton non valide",
  "emalreverified":"E-mail déjà vérifié",
  "toknotfound":"jeton non trouvé",
  "errorlors":"Erreur lors de la confirmation de l'email.",
  "emailexist":"Email déjà existant",
  "emaintnon":"Email ou mot de passe incorrect",
  "upload":"Télécharger",
  "thanksevaliation":"Merci pour votre évaluation de",
  "star":"étoile(s)",
  "checkemail":"Veuillez vérifier votre e-mail",
  "Sign-inSuccessfully":"Connexion réussie",
    "Sign-outSuccessfully":"Déconnexion réussie",
    "thankformessage":"Merci pour votre message !",
    "désquepossible":"Nous reviendrons vers vous dès que possible",
    "emailnotvalid":"Email non Valide",
    "messagenotvalid":"Min:10 caractères, Max:250 caractères",
    "emailnotconfirm":"Veuillez confirmer votre adresse e-mail",
    "more":"Plus",
    "titlecoulisse":"Une Vue Éclairée sur les",
    "coulisses":"coulisses",
    "title2coulisse":"de mon Portefeuille",
    "paragrapheaccordion":"Je considère que la transparence technique est cruciale, c'est pourquoi je souhaite partager les dessous du processus de création de mon site web. En dévoilant les coulisses de l'infrastructure, l'objectif est de fournir une compréhension claire de la plateforme. Du côté frontend, j'ai privilégié des outils qui garantissent une expérience utilisateur dynamique et réactive. L'accent a été mis sur la rapidité de développement avec des solutions d'optimisation appropriées. Pour l'hébergement, une plateforme fiable a été choisie, et du côté backend, des technologies ont été sélectionnées pour assurer une base solide. La sécurité a été une préoccupation majeure, avec la mise en place de protocoles pour garantir la protection des utilisateurs. L'intention derrière cette transparence technique est de construire une confiance totale et de souligner l'engagement envers une approche moderne, performante et sécurisée du développement web."



}
